[
  {
    "Name": "Emily B",
    "Title": "Actually shocked at my results",
    "Description": "I added the Bakuchiol Age Delay Serum into my normal routine and the difference in my forehead lines is honestly wild. My skin texture looks smoother and more even. I compared photos from nine months apart and the improvements really kicked in after I introduced this for the last three months.",
    "Date": "November 14, 2025",
    "Stars": 5,
    "Image1": "https://cdn.shopify.com/s/files/1/0702/9991/0336/files/61_RI4aLdtL.jpg?v=1761618015"
  },
  {
    "Name": "Jeff Seagondollar",
    "Title": "My wife made me try it... she was right",
    "Description": "My wife kept telling me to try bakuchiol because retinol always irritated my skin. I finally gave it a shot, and after about three weeks I’m honestly surprised at how much smoother and more rested my face looks. The lines around my eyes aren’t as sharp, and my overall skin just looks healthier without any redness or peeling. Didn’t expect to notice a difference, but it’s legit.",
    "Date": "November 14, 2025",
    "Stars": 5,
    "Image1": "https://cdn.shopify.com/s/files/1/0702/9991/0336/files/71kyqVhjxqL.jpg?v=1761615186",
    "Image2": "https://cdn.shopify.com/s/files/1/0702/9991/0336/files/71rNkQ8J92L.jpg?v=1761615186"
  },
    {
    "Name": "Jaimie R",
    "Title": "Didn’t expect this much change tbh",
    "Description": "I’m not usually a skincare guy, but hitting my mid-30s made the lines on my forehead show up fast. Retinol was way too harsh for me, so I figured I’d try a gentler option. After about 4–5 weeks with this bakuchiol serum, my skin legit looks smoother and less tense. The texture across my forehead evened out a lot, and those deep-looking creases between my brows softened way more than I expected. My skin tone looks brighter too, not as blotchy. It has a super light, calming tea-like scent that’s actually nice. If you’re sensitive to retinol but want results, this is worth a shot.",
    "Date": "November 13 2025",
    "Stars": 5,
    "Image1": "https://cdn.shopify.com/s/files/1/0946/8762/5529/files/beforeAfter7.jpg?v=1763416282"
  },
  {
    "Name": "Syd M",
    "Title": "My favorite gentle anti-aging step",
    "Description": "Retinol always irritates my skin but I still wanted something for fine lines. This serum has been the perfect replacement. My under-eye area and cheeks look smoother and my skin tone looks more even. It also has a really soft scent, kind of like lavender tea, which I love at night.",
    "Date": "November 12, 2025",
    "Stars": 5
  },
  {
    "Name": "Erin E. Dobbins",
    "Title": "If you’re sensitive to retinol, try this",
    "Description": "I’m 36 and retinol dries me out no matter how careful I am. This bakuchiol serum gives me the same smoothing effect without the irritation. The lines around my eyes and mouth look much softer. Very happy I switched.",
    "Date": "November 12, 2025",
    "Stars": 5
  },
  {
    "Name": "Adil Salam",
    "Title": "Noticeable improvement around my eyes",
    "Description": "i wasn’t expecting much but the fine lines around my eyes definitely look smoother. Easy to use and no irritation at all. Pleasant surprise.",
    "Date": "November 11, 2025",
    "Stars": 5
  },
  {
    "Name": "Alyssa Hackett",
    "Title": "Skin feels so smooth",
    "Description": "After a few nights of using this, my skin feels softer and my makeup sits better. My forehead lines don’t stand out as much either. Really impressed.",
    "Date": "November 9, 2025",
    "Stars": 5
  },
  {
    "Name": "Sanjana",
    "Title": "Really works for texture",
    "Description": "My skin tends to look dull and uneven, and this helped a lot. My fine lines softened, especially around my eyes. My before and after photos are actually kind of crazy.",
    "Date": "November 8, 2025",
    "Stars": 5
  },
  {
    "Name": "Jenny Plinke",
    "Title": "Glad I took before photos",
    "Description": "The changes were gradual, but when I compared my pictures after two months the difference was obvious. The tiny lines near my eyes looked softer and my overall skin texture improved.",
    "Date": "November 7, 2025",
    "Stars": 5,
    "Image1": "https://cdn.shopify.com/s/files/1/0702/9991/0336/files/71Z-Qryq2eL_1.jpg?v=1761444014"
  },
  {
    "Name": "Maggie",
    "Title": "Seems promising",
    "Description": "I haven’t used it long enough to see major results yet, but my skin feels nice and smooth. No irritation, which is rare for me.",
    "Date": "November 6, 2025",
    "Stars": 4
  },
  {
    "Name": "Lindsay M",
    "Title": "Texture and discoloration REALLY improved",
    "Description": "I’ve tried so many brightening products and none of them helped the blotchy texture and sun spots on my forehead. Retinol always irritated my skin, so I honestly didn’t expect much from this either. But the results are actually impressive. After about 6–8 weeks, my forehead looks way clearer, smoother, and more even-toned. The redness around my nose calmed down too. My whole face looks more refined and balanced. It’s gentle, absorbs quickly, and has a soft lavender-ish smell that I actually love at night. Super happy I gave it a try.",
    "Date": "November 6 2025",
    "Stars": 5,
    "Image1": "https://cdn.shopify.com/s/files/1/0946/8762/5529/files/beforeafter4.jpg?v=1763416282"
  },
  {
    "Name": "Shelly",
    "Title": "Love this in my night routine",
    "Description": "Great serum. My skin looks smoother when I wake up and the smile lines around my mouth are less noticeable. It feels super gentle too.",
    "Date": "November 5, 2025",
    "Stars": 5
  },
  {
    "Name": "Starboy",
    "Title": "Hydrating and smoothing",
    "Description": "Using this regularly has made my skin look smoother and more hydrated. My fine lines aren’t gone, but they’re definitely softened. Really solid product.",
    "Date": "November 5, 2025",
    "Stars": 4
  },
  {
    "Name": "Autumn L. Malone",
    "Title": "Not sure it's for me yet",
    "Description": "I’ve seen some softer lines but not a dramatic change. My skin feels smoother though. I’m going to keep using it a bit longer before deciding.",
    "Date": "November 5, 2025",
    "Stars": 4
  },
  {
    "Name": "m",
    "Title": "tiktok made me try it",
    "Description": "i’ve been using it for a few weeks and the tiny lines near my eyes look a little softer. No irritation at all, which is a big win. Hoping for even better results with time.",
    "Date": "November 5, 2025",
    "Stars": 3
  },
  {
    "Name": "David",
    "Title": "Pretty good so far",
    "Description": "The fine lines under my eyes look less harsh and my skin feels smoother overall. Was hoping for a little more, but it’s definitely helping.",
    "Date": "November 5, 2025",
    "Stars": 3
  },
  {
    "Name": "Tara V",
    "Title": "My skin finally looks smooth and glowy",
    "Description": "okay so I wasn’t expecting much because my skin is really reactive and most serums either break me out or make me greasy. but this one ended up being perfect for me. The little bumps and uneven texture on my cheeks smoothed out so much, and my skin looks brighter and fresh. The glow in the after photo is totally real, no makeup. No irritation, no peeling, nothing. Just healthy, smooth skin. It even makes my pores look smaller. This is definitely staying in my routine.",
    "Date": "November 5 2025",
    "Stars": 5,
    "Image1": "https://cdn.shopify.com/s/files/1/0946/8762/5529/files/beforeAfter2.jpg?v=1763416282"
  },
  {
    "Name": "Marisa",
    "Title": "Take before and after photos",
    "Description": "My skin looks noticeably smoother after about a month of consistent use. The lines near my lips especially look softened. Definitely worth it.",
    "Date": "November 5, 2025",
    "Stars": 5
  },
  {
    "Name": "Cindy S",
    "Title": "Definitely works",
    "Description": "This fits perfectly into my routine. My skin texture is smoother and the lines around my eyes aren’t as sharp. Very pleased.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Kadir Basaran",
    "Title": "Fantastic product and service",
    "Description": "The serum arrived in perfect condition and feels really high quality. I’ve already noticed smoother texture after consistent use.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Nana",
    "Title": "Experimenting has paid off",
    "Description": "I was skeptical at first, but after two months the lines around my mouth and eyes look softer. My skin just looks healthier and more rested overall.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Giselle Lucero",
    "Title": "I can’t believe it actually works",
    "Description": "This made such a difference in the early lines I was starting to see. My skin looks smoother and more even toned. Also the scent is really calming, kind of like a light floral tea.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Lila",
    "Title": "Works but you need consistency",
    "Description": "It definitely works, but you have to keep using it. If I skip a day, the effect fades a little. My under-eyes look smoother when I stay consistent.",
    "Date": "October 29, 2025",
    "Stars": 4
  },
  {
    "Name": "Sinceray",
    "Title": "Yes it works",
    "Description": "The fine lines around my mouth were starting to bother me, and this has softened them so much. It took a couple weeks, but the results were worth the wait.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Jenny Plinke",
    "Title": "Impressive results",
    "Description": "When I compared before and after, the lines under my eyes were noticeably less deep and my skin tone looked more even. Really happy with it.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Ravvi A",
    "Title": "Surprisingly effective",
    "Description": "My forehead looks smoother and my skin feels softer. I wish it worked a little faster on deeper lines, but it’s still doing a great job.",
    "Date": "October 29, 2025",
    "Stars": 4
  },
  {
    "Name": "Busenur Temür",
    "Title": "Good",
    "Description": "My skin feels softer and more nourished. I’ve definitely noticed an improvement in texture.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Patricia Le",
    "Title": "Still watching for results",
    "Description": "My lips and under-eyes look smoother, but some areas haven’t changed as much as I hoped. Still, the texture benefits alone make it worth using.",
    "Date": "October 29, 2025",
    "Stars": 4
  },
  {
    "Name": "Tina Munster",
    "Title": "Working so far",
    "Description": "i lost some weight in my face and my under-eyes started looking hollow. After a few uses, the area looks softer and not as shadowy. Very promising so far.",
    "Date": "October 22, 2025",
    "Stars": 4
  },
  {
    "Name": "Amanda",
    "Title": "Highly recommend",
    "Description": "My dark circles and fine lines look lighter and my skin feels healthier overall. Really impressed and I’ve barely made a dent in the bottle.",
    "Date": "October 22, 2025",
    "Stars": 5
  },
  {
    "Name": "OU812Shelby",
    "Title": "Big bottle for the price",
    "Description": "Just started using this and the size is generous. It feels gentle and hydrating. Excited to see how well it works long term.",
    "Date": "October 22, 2025",
    "Stars": 4
  },
  {
    "Name": "Chloe S",
    "Title": "Under eye hollows reduced",
    "Description": "My under-eyes look smoother and less hollow after a few weeks. It doesn’t irritate my skin and has a clean, subtle scent. Really impressed.",
    "Date": "October 22, 2025",
    "Stars": 5
  },
  {
    "Name": "MB",
    "Title": "Does wonders for the skin",
    "Description": "I get creasing under my eyes and this softened them a lot. My skin looks fresher in the morning and the texture is noticeably better.",
    "Date": "October 22, 2025",
    "Stars": 5
  },
  {
    "Name": "Lovefebe",
    "Title": "Saw a little change already",
    "Description": "I wasn’t expecting results right away, but after two days I noticed a little extra smoothness. Excited to see where it goes.",
    "Date": "October 22, 2025",
    "Stars": 4
  },
  {
    "Name": "Customer",
    "Title": "Perfect",
    "Description": "The seller fixed a shipping issue for me immediately and the product arrived perfectly. Feels very high quality. No complaints at all.",
    "Date": "October 22, 2025",
    "Stars": 5
  }
]