[
  {
    "Name": "Emily B",
    "Title": "Great for fine lines and wrinkles",
    "Description": "Adding Bakuchiol Age Delay Serum into my routine with a vitamin C serum and tretinoin 1–2 times a week has transformed my skin. It’s been so effective at softening fine lines and wrinkles - these three are the trifecta along with a good moisturizer. The difference between these photos is 9 months, and I only added the bakuchiol serum for the last 3. The results are astounding!",
    "Date": "November 14, 2025",
    "Stars": 5,
    "Image1": "https://cdn.shopify.com/s/files/1/0702/9991/0336/files/61_RI4aLdtL.jpg?v=1761618015"
  },
  {
    "Name": "Jeff Seagondollar",
    "Title": "Fountain of Youth",
    "Description": "I don't write reviews but I had to on this one! I used Bakuchiol Age Delay Serum on one side of my husband’s face last night and the next morning you could really see a difference. On my own skin it’s been incredible - overnight my under-eye area looks smoother and more refreshed and my whole face looks more youthful and bouncy. If you’re dealing with age-related skin changes, this is the stuff for you.",
    "Date": "November 14, 2025",
    "Stars": 5,
    "Image1": "https://cdn.shopify.com/s/files/1/0702/9991/0336/files/71kyqVhjxqL.jpg?v=1761615186",
    "Image2": "https://cdn.shopify.com/s/files/1/0702/9991/0336/files/71rNkQ8J92L.jpg?v=1761615186"
  },
  {
    "Name": "Syd M",
    "Title": "HOLY GRAIL SKINCARE BOOSTER",
    "Description": "Discovering Bakuchiol Age Delay Serum has been a game-changer in my skincare journey. I’ve always been interested in gently enhancing certain areas, and mixing this serum with my eye cream has been transformative. What stands out is how it smooths and strengthens the skin’s barrier, giving a naturally bouncier, more youthful look. The firmness and softness around my eye area have noticeably improved, fine lines look softer, and my skin feels more hydrated and resilient. A little goes a long way and I love that I can mix it into different moisturizers to target specific areas.",
    "Date": "November 12, 2025",
    "Stars": 5
  },
  {
    "Name": "Erin E. Dobbins",
    "Title": "WARNING… IT WORKS",
    "Description": "I’m 36 and have had under-eye filler in the past. This serum definitely does something for me. I see more smoothness and a healthier fullness in the areas where I’ve used it (mostly my face). I originally found it on TikTok and after doing my research I felt comfortable adding bakuchiol into my routine - and I’m glad I did.",
    "Date": "November 12, 2025",
    "Stars": 5
  },
  {
    "Name": "Gin",
    "Title": "Results coming in",
    "Description": "I started adding a few drops of Bakuchiol Age Delay Serum into my peptide moisturizer and even mixed a little into a small jar of lip balm. I apply it carefully under my eyes and on my lips after microneedling. After about 3 weeks I’ve started noticing a real difference - my lips look smoother and more defined with a natural rosy look, and the under-eye area is looking softer and more refreshed. As a mature woman with naturally thinning lips, it feels amazing to finally see them look more youthful again. I’m excited to keep using this because the results are getting better each week.",
    "Date": "November 11, 2025",
    "Stars": 5
  },
  {
    "Name": "adil salam",
    "Title": "Works",
    "Description": "Worked like a charm on my eyelids and noticeably softened the look of my upper-eyelid area.",
    "Date": "November 11, 2025",
    "Stars": 5
  },
  {
    "Name": "melissa",
    "Title": "PLEASE READ!!",
    "Description": "3 weeks in and this has made my lips go from thin and lined to smoother and more pillowy. They look beautiful and naturally plumper. I also tried it on my chest and the skin looks much smoother and more supple. It really works - it’s amazing!",
    "Date": "November 10, 2025",
    "Stars": 5
  },
  {
    "Name": "Hania Zainulabidin",
    "Title": "Works amazing for lips",
    "Description": "I have naturally quite thin lips, especially my top lip, and I’ve been using this for a few days. It works really well - I’ve noticed more definition and smoothness. My upper lip looks a bit fuller and so does my lower one. I use the dropper directly on my lips and then seal it with Vaseline.",
    "Date": "November 9, 2025",
    "Stars": 5
  },
  {
    "Name": "Alyssa Hackett",
    "Title": "Love it",
    "Description": "Great product - I’ve been using it in my nightly routine and I’m happy with the results so far. My skin feels more hydrated and looks a little smoother each week.",
    "Date": "November 9, 2025",
    "Stars": 5
  },
  {
    "Name": "Sarah",
    "Title": "Minimal results so far",
    "Description": "Saw someone say it helps enhance any area you want, so I got it for my lips to make them look a bit fuller. I noticed some subtle results in a week, and I’ll keep trying it over the next month to see how much more it can do.",
    "Date": "November 8, 2025",
    "Stars": 4
  },
  {
    "Name": "Sanjana",
    "Title": "Really works",
    "Description": "So far, sooooo good - don’t want to jinx it, but my photos say it all! My under-eye area looks smoother and less tired.",
    "Date": "November 8, 2025",
    "Stars": 5
  },
  {
    "Name": "James & Heather",
    "Title": "Small but noticeable difference",
    "Description": "After dealing with loss of volume for half a year, my skin has gradually started to look smoother and less sunken since using this serum. The change is subtle and natural, which is exactly what we wanted, and it did take a while to see, but we’re very satisfied so far.",
    "Date": "November 7, 2025",
    "Stars": 4
  },
  {
    "Name": "Jenny Plinke",
    "Title": "It Works",
    "Description": "I was hopeful this product would work after seeing a few TikTok before-and-afters. I’m glad I took my own before photo because I wasn’t noticing the change day-to-day. After 2 months of use, you can clearly see the appearance of hollowness under my eyes has reduced a lot. I add 1 drop into every application of under-eye cream at night. I also use it on my lips, and they feel extra hydrated and look more plump when I wake up. I will definitely continue to use it.",
    "Date": "November 7, 2025",
    "Stars": 5,
    "Image1": "https://cdn.shopify.com/s/files/1/0702/9991/0336/files/71Z-Qryq2eL_1.jpg?v=1761444014"
  },
  {
    "Name": "Sage Brandt",
    "Title": "I'm not sure yet",
    "Description": "Bought this to see if it’s really giving people these crazy results - I was skeptical. No, it doesn’t work overnight. I’ve been using it under my eyes and on my lips and I’ve seen some hydration and a decent difference in my under-eyes, but I’m not completely sure yet 🫣. It feels like a light oil so I’ve been putting it on top of products at night. I’ll keep using the whole bottle and see if I notice a bigger change.",
    "Date": "November 7, 2025",
    "Stars": 4
  },
  {
    "Name": "Maggie",
    "Title": "I'll keep updating",
    "Description": "Haven't used it long enough to see big results yet, but I’ve had no problems and it feels nice on the skin.",
    "Date": "November 6, 2025",
    "Stars": 4
  },
  {
    "Name": "Shelly",
    "Title": "MIX WITH SKIN SAFE FACIAL OIL",
    "Description": "Love this serum! I use it on my lips, marionette lines and under my eyes. I mixed a few drops into a lip oil for use throughout the day, then mix a few more with rosehip facial oil before bed for my face. Everything looks smoother and more hydrated when I wake up.",
    "Date": "November 5, 2025",
    "Stars": 5
  },
  {
    "Name": "Starboy",
    "Title": "Moisturizing",
    "Description": "I’ve been using it mixed into my moisturizer as an eye cream, and it’s been a great addition to my routine. It feels very hydrating and has definitely improved the look of my under-eye area. My eye bags look less sunken and the skin appears plumper and healthier. The results so far are really good - it feels like a much more expensive eye cream without the price tag.",
    "Date": "November 5, 2025",
    "Stars": 4
  },
  {
    "Name": "Caitlin",
    "Title": "This stuff works!",
    "Description": "I truly have no idea what kind of magic is happening, but after one night of use I noticed crazy results. I’ve had genetic dark circles caused by hollow eyes my whole life and after one night they already looked less harsh. It’s also made my lips look smoother and fuller. I even put some on one side of my chest to even things out and honestly it looks more balanced now LOL. Basically, it works - anywhere you put it, it will make the skin look smoother and more padded, so be precise. I don’t know if it’s just hydrating and strengthening the skin or something more, but for me it’s absolutely worth a shot. Just use your best judgment!",
    "Date": "November 5, 2025",
    "Stars": 5
  },
  {
    "Name": "Diego",
    "Title": "Works",
    "Description": "Helped with dark circles under my eyes. After about 2 weeks you can notice a difference in how bright and rested the area looks.",
    "Date": "November 5, 2025",
    "Stars": 4
  },
  {
    "Name": "Autumn L. Malone",
    "Title": "Not sure it’s for me",
    "Description": "Used this for a few weeks and didn’t notice much of a difference yet. I don’t think it was very effective for my particular skin. I may try another bakuchiol product to compare.",
    "Date": "November 5, 2025",
    "Stars": 4
  },
  {
    "Name": "m",
    "Title": "TikTok influenced me lol!",
    "Description": "I’ve only been using it for a few weeks and can’t say I’ve noticed a huge difference yet. I’ve noticed my eye wrinkles aren’t as bad, but no idea if I’m just being delulu. 😂 No irritation at all, and I have extremely sensitive skin, so that’s a big plus. I’ll try to remember to come back and update if anything magical happens.",
    "Date": "November 5, 2025",
    "Stars": 3
  },
  {
    "Name": "kwi",
    "Title": "This stuff works-with a few caveats.",
    "Description": "This looks and feels like a light oil. It doesn’t layer well under makeup or with some other products, but it really does help with that under-eye transition on or below the orbital bone. It smooths out that area so the dip is less noticeable. I can only use it at night, after applying retinol and letting that absorb. When I’ve tried using it in the daytime, sunscreen or makeup over it causes pilling. Sometimes I’ll use it a few hours before a special event, then wash it off before makeup. Used correctly, it definitely softens the look of hollows.",
    "Date": "November 5, 2025",
    "Stars": 4
  },
  {
    "Name": "T",
    "Title": "So far good",
    "Description": "I've been using this under my eyes for a few weeks and my under-eyes do look fuller and less tired. It doesn’t irritate my skin at all. It also comes with a cute little container to mix your products and a spoon.",
    "Date": "November 5, 2025",
    "Stars": 4
  },
  {
    "Name": "David",
    "Title": "Pretty good",
    "Description": "I used it hoping to get rid of fine lines and eye bags, but for me it mainly just deeply hydrated my under-eyes. Still, the area looks smoother and healthier, so I’m not mad at it.",
    "Date": "November 5, 2025",
    "Stars": 3
  },
  {
    "Name": "Marisa",
    "Title": "Take before and after photos!!!",
    "Description": "Extremely pleasantly surprised to say that this 100% works! I’ve been using it for just under a month and felt like I was only seeing a subtle improvement, but my before/after photos are crazy and undeniable. My eyes and lips are where I notice the biggest difference, but my whole face looks smoother overall. For reference, I’ve been applying a few drops in the morning and before bed every day. I usually apply it directly, then wait about 15 minutes before layering other products.",
    "Date": "November 5, 2025",
    "Stars": 5
  },
  {
    "Name": "Cindy S",
    "Title": "Definitely works",
    "Description": "This definitely does something. I use it with products that help with cell turnover like retinol and glycolic acid, which might boost the results a bit. It might not work as well if you never exfoliate. I no longer feel like I need lip filler - this gives such a natural, smoothed-out result without that overdone look.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Kadir Basaran",
    "Title": "Thank you for your excellent product and service",
    "Description": "Hello,\n\nThank you for providing such a high-quality product and outstanding service. Everything went smoothly, and your prompt communication made the experience even better. I look forward to ordering again in the future.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Nana",
    "Title": "Experimenting is key",
    "Description": "I was initially a bit skeptical about this serum, but after two months of use I’ve seen a noticeable difference in both my smile lines and the natural hollows under my eyes. I mix a few drops with a moisturizer recommended by my dermatologist and apply it nightly. The improvement has been substantial.\n\nI didn’t notice anything overnight, but with continued nightly use the results really started to show. Applying it directly without a serum or moisturizer made my skin a little sensitive, so definitely follow the instructions if you have reactive skin like mine.\n\nExperimenting is key - I’ve mainly used it on my face, but I know you can use it on other areas too. I’m happy with the results so far and plan to keep going. For anyone on the fence, I’d say give bakuchiol a shot; it’s worked wonders for me.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Giselle lucero",
    "Title": "I can’t believe this actually works!",
    "Description": "I use this with my Charlotte Tilbury watery cream and it also layers well with azelaic acid. I apply everything around the sides of my nose and inner corners of my eyes for hollowness. It has given me back a softer, more youthful look in my face and also helps with fine lines. I’m 20 and was starting to see small smile lines from lots of laughing and braces, and it’s helped so much!",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Lila",
    "Title": "Works but doesn’t last",
    "Description": "I’m about two-thirds through the bottle. It definitely works for me, but if I skip a day the results are less noticeable, so it’s definitely something you need to keep up with. I use it on my under-eyes and my lips every night. Still like it a lot, just know that the best results come with consistent use.",
    "Date": "October 29, 2025",
    "Stars": 4
  },
  {
    "Name": "Sinceray",
    "Title": "Yes it works",
    "Description": "I’m 38 and my lips have always had a lot of lines and needed more softness. I put a few drops of this on an EOS chapstick and let it sit overnight, and my lips are now much smoother, softer, and look more defined. It’s a two-week process, but if you stick with it you’ll definitely notice fewer lines and a healthier look. I still use it every night and day - you won’t be disappointed, sis 💋💕",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Jenny plinke",
    "Title": "It works",
    "Description": "I was hopeful this product would work after seeing TikTok videos of before and afters. I’m glad I took a before photo because I wasn’t noticing the change while I used it. After 2 months, you can clearly see the appearance of hollowness under my eyes has reduced quite a bit. I add 1 drop into every application of under-eye cream at night. I also use it at night on my lips and they’ve been extra hydrated and a bit more plump when I wake up. I will definitely continue to use it.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Ravvi A.",
    "Title": "Amazing!",
    "Description": "Definitely saw a difference in smoothness and overall skin texture. It could be a bit stronger for stubborn areas, but overall it’s a great product.",
    "Date": "October 29, 2025",
    "Stars": 4
  },
  {
    "Name": "Busenur temür",
    "Title": "Good",
    "Description": "Good - skin feels softer and more nourished.",
    "Date": "October 29, 2025",
    "Stars": 5
  },
  {
    "Name": "Patricia Le",
    "Title": "Is it working?",
    "Description": "This is my second bottle and I’m still not totally sure how much of a difference it’s making in some areas. I use it as my last step on places I want to smooth and cushion, like under-eyes, temples, my 11s, and forehead. I was inconsistent at first, but for the past 35 days I’ve been very religious with nightly use. I’ve noticed my lips look a bit more plump and smooth, which is nice - I’m still watching the other areas over time.",
    "Date": "October 29, 2025",
    "Stars": 4
  },
  {
    "Name": "Tina Munster",
    "Title": "Working so far",
    "Description": "I lost some weight in my face and my eyes started to look a little sunken and dark. I’ve used this 4 times so far and already noticed a difference. My under-eye area looks less hollow and the darkness has diminished a lot. I know it recommends mixing with moisturizer, but I’ve been putting a tiny amount directly on my skin with a q-tip and being precise. Just don’t let it get into your eyes. Overall, I definitely recommend!",
    "Date": "October 22, 2025",
    "Stars": 4
  },
  {
    "Name": "amanda",
    "Title": "Highly recommend",
    "Description": "I’ve noticed a big reduction in the dark circles I’ve been dealing with for the last few years and I’ve only used it for a few months. It’s effective, moisturizing, and I’ve barely used 20% of the bottle.",
    "Date": "October 22, 2025",
    "Stars": 5
  },
  {
    "Name": "OU812Shelby",
    "Title": "Big bottle",
    "Description": "Just started using. I was shocked how big the bottle is for the price I paid. Excited to see long-term results.",
    "Date": "October 22, 2025",
    "Stars": 4
  },
  {
    "Name": "Chloe S",
    "Title": "Under-eye hollows reduced!",
    "Description": "This is quite amazing and I’m really wondering how it works so well. I have fairly severe hollows and dark circles. I mixed some with my eye cream in the tub and have been applying it nightly. The skin under my eyes appears much more cushioned and the hollows are less harsh. Dark circles are still there (that’s mostly color), but I definitely look younger because everything looks smoother.",
    "Date": "October 22, 2025",
    "Stars": 5
  },
  {
    "Name": "mb",
    "Title": "Does wonders for the skin!",
    "Description": "I can’t even explain how much this has changed my skin. I typically use it for my under-eyes, where I have creases, and the difference is very noticeable. It’s recommended to use with a moisturizer; I pair it with my La Roche-Posay cream and my skin looks like glass.",
    "Date": "October 22, 2025",
    "Stars": 5
  },
  {
    "Name": "lovefebe",
    "Title": "Did see some plump but I've only used it 2 days",
    "Description": "It came way faster than I expected, which was great. The first time I applied it I honestly didn’t expect to see an overnight difference, but I did see a slight change by morning. I’m really good at noticing small details, so not everyone will see something right away. Since I haven’t used it very long I gave it 4 stars - it wouldn’t be fair to rate it 5 yet.",
    "Date": "October 22, 2025",
    "Stars": 4
  },
  {
    "Name": "customer",
    "Title": "Perfect",
    "Description": "I contacted the seller and they resolved the delivery issues I had very quickly. Great customer service and the product arrived in perfect condition.",
    "Date": "October 22, 2025",
    "Stars": 5
  }
]